In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df_first_class = pd.read_csv('pclass1_data_.csv')

In [4]:
df_first_class.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,Cherbourg
1,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,Southampton
2,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,Southampton
3,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,Southampton
4,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,Southampton
5,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,Southampton
6,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,Cherbourg
7,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,34.0,1,0,PC 17569,146.5208,B78,Cherbourg
8,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,Cherbourg
9,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,Southampton

In [5]:
df_first_class.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,216.000000,216.000000,216.0,216.000000,216.000000,216.000000,216.000000
mean,461.597222,0.629630,1.0,38.326019,0.416667,0.356481,84.154687
std,246.737616,0.484026,0.0,13.785435,0.611898,0.693997,78.380373
min,2.000000,0.000000,1.0,0.920000,0.000000,0.000000,0.000000
25%,270.750000,0.000000,1.0,29.000000,0.000000,0.000000,30.923950
50%,472.000000,1.000000,1.0,38.000000,0.000000,0.000000,60.287500
75%,670.500000,1.000000,1.0,47.250000,1.000000,0.000000,93.500000
max,890.000000,1.000000,1.0,80.000000,3.000000,4.000000,512.329200

In [15]:
CV = df_first_class['Age'].std()/df_first_class['Age'].median()

In [16]:
print(CV)

0.36277461092784075